tsungconf.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/user/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug" version="1.0">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="20000" />
  </clients>

  <servers>
    <server host="167.99.103.140" port="8080" type="tcp" />
  </servers>

  <load>
    <arrivalphase phase="1" duration="120" unit="second">
      <users maxnumber="10000" arrivalrate="200" unit="second" />
    </arrivalphase>
  </load>

  <options>
    <option name="ports_range" min="1025" max="65535"/>
  </options>

  <sessions>
    <session name="websocket" probability="100" type="ts_websocket">
      <request>
        <websocket type="connect" path="/socket/websocket"></websocket>
      </request>
        
        <request>
            <websocket type="message" frame="text">{"author":"me","type":"text","data":{"text":"hi"}}</websocket>
        </request>

      <for var="i" from="1" to="10" incr="1">
        <thinktime value="10"/>
        <request>
          <websocket ack="no_ack" type="message" frame="text">{"author":"me","type":"text","data":{"text":"heartbeat"}}</websocket>
        </request>
      </for>
    </session>
  </sessions>
</tsung>